# Pandas Tutorial

In [1]:
import pandas as pd
import os # tells where te file is

In [2]:
# DataFrames are maade up of series
sereies_test = [1,2,3,4]
print(pd.Series(sereies_test))

0    1
1    2
2    3
3    4
dtype: int64

## Importing practice dataset

In [3]:
pwd = os.getcwd() # get current working directory

filepath = pwd + "/Practice datasets/simple_csv.csv"

first_df = pd.read_csv(filepath,nrows=10) # reads the csv file into python
first_df

    Column1   Column2   Column3
0  0.280925  0.910368  0.692982
1  0.719882  0.210024  0.761276
2  0.235752  0.059796  0.154667
3  0.603366  0.485614  0.013345
4  0.039985  0.236359  0.811832
5  0.015478  0.543641  0.112719
6  0.192540  0.409874  0.875082
7  0.380921  0.045468  0.515859
8  0.592471  0.786421  0.047249
9  0.072112  0.695694  0.409573

# Exploring dataset

## **Looking at Columns**
The **best** way to look at the data is to inspect it in parts by looking at **subsets** of the data. For example lets subset a column by name, shown below:

In [4]:
first_df.head() # returns the 1st 5 rows.

    Column1   Column2   Column3
0  0.280925  0.910368  0.692982
1  0.719882  0.210024  0.761276
2  0.235752  0.059796  0.154667
3  0.603366  0.485614  0.013345
4  0.039985  0.236359  0.811832

In [5]:
# subset column by name
first_df['Column1']

0    0.280925
1    0.719882
2    0.235752
3    0.603366
4    0.039985
5    0.015478
6    0.192540
7    0.380921
8    0.592471
9    0.072112
Name: Column1, dtype: float64

## **OR** 
### we assign a coloumn to it's own variable. We get the same output.

In [6]:
# get the 1st column and assign it to it's own variable.
column1_df = first_df['Column1']
column1_df.head()

0    0.280925
1    0.719882
2    0.235752
3    0.603366
4    0.039985
Name: Column1, dtype: float64

To specify multiple columns by the column name, you need to pass in a Python *List* between the square brakets.

In [7]:
subset = first_df[['Column1', 'Column2']] # List passed in here.
subset.head()

    Column1   Column2
0  0.280925  0.910368
1  0.719882  0.210024
2  0.235752  0.059796
3  0.603366  0.485614
4  0.039985  0.236359

## Creating new Columns

In [8]:
first_df["new_column"] = 1
first_df["New_column2"] = list(range(10))
first_df

    Column1   Column2   Column3  new_column  New_column2
0  0.280925  0.910368  0.692982           1            0
1  0.719882  0.210024  0.761276           1            1
2  0.235752  0.059796  0.154667           1            2
3  0.603366  0.485614  0.013345           1            3
4  0.039985  0.236359  0.811832           1            4
5  0.015478  0.543641  0.112719           1            5
6  0.192540  0.409874  0.875082           1            6
7  0.380921  0.045468  0.515859           1            7
8  0.592471  0.786421  0.047249           1            8
9  0.072112  0.695694  0.409573           1            9

you can even add columns together as shown below:

In [9]:
first_df["Added_output"] = first_df["new_column"] + first_df["New_column2"]
first_df

    Column1   Column2   Column3  new_column  New_column2  Added_output
0  0.280925  0.910368  0.692982           1            0             1
1  0.719882  0.210024  0.761276           1            1             2
2  0.235752  0.059796  0.154667           1            2             3
3  0.603366  0.485614  0.013345           1            3             4
4  0.039985  0.236359  0.811832           1            4             5
5  0.015478  0.543641  0.112719           1            5             6
6  0.192540  0.409874  0.875082           1            6             7
7  0.380921  0.045468  0.515859           1            7             8
8  0.592471  0.786421  0.047249           1            8             9
9  0.072112  0.695694  0.409573           1            9            10

## dropping columns

In [10]:
first_df.drop(columns=['new_column'])

    Column1   Column2   Column3  New_column2  Added_output
0  0.280925  0.910368  0.692982            0             1
1  0.719882  0.210024  0.761276            1             2
2  0.235752  0.059796  0.154667            2             3
3  0.603366  0.485614  0.013345            3             4
4  0.039985  0.236359  0.811832            4             5
5  0.015478  0.543641  0.112719            5             6
6  0.192540  0.409874  0.875082            6             7
7  0.380921  0.045468  0.515859            7             8
8  0.592471  0.786421  0.047249            8             9
9  0.072112  0.695694  0.409573            9            10

# **Looking at Rows**
## Rows can be subseted by either using the row *name* or *index*. 

* **loc** - Subset based on row name.

* **iloc** - Subset based on row index / number.

In [11]:
first_df.head()

    Column1   Column2   Column3  new_column  New_column2  Added_output
0  0.280925  0.910368  0.692982           1            0             1
1  0.719882  0.210024  0.761276           1            1             2
2  0.235752  0.059796  0.154667           1            2             3
3  0.603366  0.485614  0.013345           1            3             4
4  0.039985  0.236359  0.811832           1            4             5

## Loc Function

In [14]:
#gets the 2nd row
first_df.loc[1]

Column1         0.719882
Column2         0.210024
Column3         0.761276
new_column      1.000000
New_column2     1.000000
Added_output    2.000000
Name: 1, dtype: float64

In [15]:
#gets the 2nd row
print(first_df.loc[2])

Column1         0.235752
Column2         0.059796
Column3         0.154667
new_column      1.000000
New_column2     2.000000
Added_output    3.000000
Name: 2, dtype: float64

In [19]:
number_of_rows = first_df.shape[0]
last_row = number_of_rows - 1
print(first_df.loc[last_row])

Column1          0.072112
Column2          0.695694
Column3          0.409573
new_column       1.000000
New_column2      9.000000
Added_output    10.000000
Name: 9, dtype: float64

## Subsetting multiple Rows
just as columns you can subset multiple rows by passing in a list

In [23]:
row_subset = first_df.loc[[2,3,5]]
print(row_subset)

    Column1   Column2   Column3  new_column  New_column2  Added_output
2  0.235752  0.059796  0.154667           1            2             3
3  0.603366  0.485614  0.013345           1            3             4
5  0.015478  0.543641  0.112719           1            5             6

# OR
subset using a range

In [28]:
# pull the 1st 5 rows of data
# Argument - dataframe.loc[ row from : row to, list_of_Columns]

rows = first_df.loc[:4, ["Column1",  "Column2", "Column3", "new_column", "New_column2", "Added_output"]]
print(rows)

    Column1   Column2   Column3  new_column  New_column2  Added_output
0  0.280925  0.910368  0.692982           1            0             1
1  0.719882  0.210024  0.761276           1            1             2
2  0.235752  0.059796  0.154667           1            2             3
3  0.603366  0.485614  0.013345           1            3             4
4  0.039985  0.236359  0.811832           1            4             5

## iloc Fucntion

In [31]:
print(first_df.iloc[:4, [0,2]])

    Column1   Column3
0  0.280925  0.692982
1  0.719882  0.761276
2  0.235752  0.154667
3  0.603366  0.013345